package com.yunnex.ops.erp.modules.store.pay.entity;

import java.util.ArrayList;
import java.util.List;
import java.util.Map;

import com.google.common.collect.Maps;

public enum OpenBankEnum {
    
    OB0(0,"请选择银行", 'Q'),
    OB1(1,"浙商银行", 'Z'),
    OB2(2,"桂林银行", 'G'),
    OB3(3,"包商银行", 'B'),
    OB4(4,"齐商银行", 'Q'),
    OB5(5,"上海银行", 'S'),
    OB6(6,"晋城市商业银行", 'J'),
    OB7(7,"河南省农村信用合作联合社", 'H'),
    OB8(8,"哈尔滨银行", 'H'),
    OB9(9,"杭州联合农村商业银行股份有限公司", 'H'),
    OB10(10,"江南农村商业银行", 'J'),
    OB11(11,"长治商业银行", 'C'),
    OB12(12,"锦州银行", 'M'),
    OB13(13,"湖南省农村信用社联合社", 'H'),
    OB14(14,"浙江民泰商业银行", 'Z'),
    OB15(15,"珠海华润银行股份有限公司总部营业部", 'Z'),
    OB16(16,"富滇银行股份有限公司", 'F'),
    OB17(17,"中山市农村信用合作联社", 'Z'),
    OB18(18,"福建省农村信用社联合社", 'F'),
    OB19(19,"江苏江阴农村商业银行股份有限公司", 'J'),
    OB20(20,"烟台银行股份有限公司", 'Y'),
    OB21(21,"湖北省农村信用社联合社结算中心", 'H'),
    OB22(22,"江苏民丰农村商业银行股份有限公司营业部", 'J'),
    OB23(23,"江苏海门农村商业银行股份有限公司营业部", 'J'),
    OB24(24,"广西壮族自治区农村信用社联合社", 'G'),
    OB25(25,"贵阳银行股份有限公司", 'G'),
    OB26(26,"九江银行合肥分行营业部", 'J'),
    OB27(27,"安庆独秀农村商业银行股份有限公司", 'A'),
    OB28(28,"景德镇市商业银行股份有限公司", 'J'),
    OB29(29,"宁夏黄河农村商业银行股份有限公司", 'N'),
    OB30(30,"重庆农村商业银行股份有限公司营业部", 'C'),
    OB31(31,"江苏省农村信用社联合社", 'J'),
    OB32(32,"江苏省农村信用社联合社", 'J'),
    OB33(33,"南洋商业银行（中国）有限公司", 'N'),
    OB34(34,"郑州银行股份有限公司", 'Z'),
    OB35(35,"晋商银行", 'J'),
    OB36(36,"乌鲁木齐市商业银行", 'W'),
    OB37(37,"上海农村商业银行", 'S'),
    OB38(38,"盛京银行", 'H'),
    OB39(39,"台州市商业银行", 'T'),
    OB40(40,"新疆维吾尔自治区农村信用社", 'X'),
    OB41(41,"天山农商银行", 'T'),
    OB42(42,"华融湘江银行股份有限公司", 'H'),
    OB43(43,"南京银行股份有限公司", 'N'),
    OB44(44,"佛山顺德农村商业银行股份有限公司", 'F'),
    OB45(45,"渤海银行股份有限公司", 'B'),
    OB46(46,"广东省农村信用社联合社", 'G'),
    OB47(47,"江苏常熟农村商业银行股份有限公司", 'J'),
    OB48(48,"德州银行股份有限公司", 'D'),
    OB49(49,"青岛银行", 'Q'),
    OB50(50,"厦门银行股份有限公司", 'X'),
    OB51(51,"襄垣县农村信用合作联社", 'X'),
    OB52(52,"陕西镇安农村合作银行", 'S'),
    OB53(53,"徐州淮海农村商业银行股份有限公司营业部", 'X'),
    OB54(54,"江苏海安农村商业银行股份有限公司营业部", 'J'),
    OB55(55,"潍坊银行", 'W'),
    OB56(56,"大连银行", 'D'),
    OB57(57,"巴彦淖尔河套农村商业银行", 'B'),
    OB58(58,"长沙银行股份有限公司", 'C'),
    OB59(59,"广西北部湾银行", 'G'),
    OB60(60,"山西侯马农村商业银行股份有限公司", 'S'),
    OB61(61,"上饶银行营业部", 'S'),
    OB62(62,"新疆汇和银行股份有限公司营业部", 'X'),
    OB63(63,"张家港农村商业银行", 'Z'),
    OB64(64,"中国光大银行", 'Z'),
    OB65(65,"华夏银行", 'H'),
    OB66(66,"中国民生银行", 'Z'),
    OB67(67,"广发银行", 'G'),
    OB68(68,"深圳发展银行(,平安银行)", 'S'),
    OB69(69,"招商银行", 'Z'),
    OB70(70,"兴业银行", 'X'),
    OB71(71,"浦发银行", 'P'),
    OB72(72,"中国邮政储蓄银行", 'Z'),
    OB73(73,"北京银行", 'B'),
    OB74(74,"鄂尔多斯市东胜蒙银村镇银行股份有限公司", 'E'),
    OB75(75,"鄂尔多斯银行", 'E'),
    OB76(76,"阳泉市商业银行", 'Y'),
    OB77(77,"银座村镇银行股份有限公司", 'Y'),
    OB78(78,"莱商银行", 'L'),
    OB79(79,"营口银行", 'Y'),
    OB80(80,"浙江泰隆商业银行", 'Z'),
    OB81(81,"吉林银行", 'J'),
    OB82(82,"丰镇市农村信用合作联社", 'F'),
    OB83(83,"呼和浩特金谷农村合作银行", 'H'),
    OB84(84,"深圳农村商业银行股份有限公司", 'S'),
    OB85(85,"广东华兴银行股份有限公司", 'G'),
    OB86(86,"玉溪市商业银行", 'Y'),
    OB87(87,"杭州银行股份有限公司", 'H'),
    OB88(88,"泉州银行股份有限公司", 'Q'),
    OB89(89,"广西桂林漓江农村合作银行", 'G'),
    OB90(90,"东莞农村商业银行股份有限公司", 'D'),
    OB91(91,"抚顺银行股份有限公司", 'F'),
    OB92(92,"江苏泗阳农村商业银行营业部", 'J'),
    OB93(93,"中信银行", 'Z'),
    OB94(94,"长安银行股份有限公司", 'C'),
    OB95(95,"贵州银行股份有限公司", 'G'),
    OB96(96,"旬阳县农村信用合作社联合社", 'X'),
    OB97(97,"中国工商银行", 'Z'),
    OB98(98,"中国农业银行", 'Z'),
    OB99(99,"中国银行", 'Z'),
    OB100(100,"中国建设银行", 'Z'),
    OB101(101,"交通银行", 'J'),
    OB102(102,"中国邮政储蓄银行", 'Z'),
    OB103(103,"北京农村商业银行", 'B'),
    OB104(104,"河南省农村信用社", 'H'),
    OB105(105,"唐山市商业银行", 'T'),
    OB106(106,"新乡银行", 'X'),
    OB107(107,"苏州银行", 'S'),
    OB108(108,"兰州银行股份有限公司", 'L'),
    OB109(109,"江苏银行", 'J'),
    OB110(110,"徽商银行", 'H'),
    OB111(111,"宁波银行", 'L'),
    OB112(112,"广州农村商业银行", 'G'),
    OB113(113,"吴江农村商业银行", 'W'),
    OB114(114,"柳州银行", 'L'),
    OB115(115,"太原市城区农村信用合作联社", 'T'),
    OB116(116,"龙江银行股份有限公司", 'L'),
    OB117(117,"曲靖市商业银行", 'Q'),
    OB118(118,"孝义市农村信用合作联社", 'X'),
    OB119(119,"江苏句容农村商业银行股份有限公司", 'J'),
    OB120(120,"邢台银行股份有限公司", 'X'),
    OB121(121,"邯郸银行股份有限公司", 'H'),
    OB122(122,"天津银行股份有限公司", 'T'),
    OB123(123,"山东济南润丰农村合作银行营业部", 'S'),
    OB124(124,"江苏启东农村商业银行股份有限公司营业部", 'J'),
    OB125(125,"石河子国民村镇银行有限责任公司", 'S'),
    OB126(126,"衡水市商业银行股份有限公司", 'H'),
    OB127(127,"江苏靖江农村商业银行股份有限公司营业部", 'J'),
    OB128(128,"宁夏银行总行营业部", 'L'),
    OB129(129,"东营银行股份有限公司", 'D'),
    OB130(130,"长安银行股份有限公司西安大唐西市支行", 'C'),
    OB131(131,"衡水市桃城区农村信用合作联社营业部", 'H'),
    OB132(132,"石嘴山银行股份有限公司", 'S'),
    OB133(133,"百色右江华润村镇银行股份有限公司", 'B'),
    OB134(134,"澳洲联邦银行（伊川）村镇银行有限责任公司", 'A'),
    OB135(135,"蒲县农村信用合作联社营业部", 'P'),
    OB136(136,"温州银行股份有限公司营业部", 'W'),
    OB137(137,"河北银行股份有限公司", 'H'),
    OB138(138,"广州增城长江村镇银行有限责任公司", 'G'),
    OB139(139,"广州银行", 'G'),
    OB140(140,"江苏姜堰农村商业银行股份有限公司营业部", 'J'),
    OB141(141, "江苏射阳农村商业银行营业部", 'J'),

    OBOTHER(200, "其他银行", 'Q');

    private int id;
    private String text;
    private char ch;

    public int getId() {
        return id;
    }

    public void setId(int id) {
        this.id = id;
    }

    public String getText() {
        return text;
    }

    public void setText(String text) {
        this.text = text;
    }

    public char getCh() {
        return ch;
    }

    public void setCh(char ch) {
        this.ch = ch;
    }

    private OpenBankEnum(int id, String text, char ch) {
        this.id = id;
        this.text = text;
        this.ch = ch;
    }
    
    public static List<Map<String, Object>> banks = new ArrayList<Map<String, Object>>();
    
    static {
        OpenBankEnum[] bankNames = OpenBankEnum.values();
        Map<String, Object> map = null;
        for (int i = 1; i < bankNames.length; i++) {
            map = Maps.newHashMap();
            map.put("id", bankNames[i].getId());
            map.put("name", bankNames[i].getText());
            map.put("ch", bankNames[i].getCh());
            banks.add(map);
        }
    }
    
}
